0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    dysonWall
    {
        type            nutUWallFunction;
        value           uniform 2.45e-4; //uniform 0.00015;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 2.45e-4; //uniform 0.00015;
    }
    outerBox
    {
        type            zeroGradient;
    }
    symmetricWall
    {
        type            zeroGradient;
    }
    outlet
    {
        //type            inletOutlet;
        //inletValue      uniform 0.00015;
        //value           uniform 0.00015;
	type		zeroGradient;

    }
}


// ************************************************************************* //
