0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 7.5;

boundaryField
{
    dysonWall
    {
        type            omegaWallFunction;
        value           uniform 7.5;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 7.5;
    }
    outerBox
    {
        type            zeroGradient;
    }
    symmetricWall
    {
        type            zeroGradient;
    }
    outlet
    {
        //type            inletOutlet;
        //inletValue      uniform 7.5;
        //value           uniform 7.5;
	type		zeroGradient;
    }
}


// ************************************************************************* //
