system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler; //steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;

    //default 	     leastSquares;
    //default	     cellLimited Gauss linear 1;

    //grad(U) 	     cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    //div(phi,U)      Gauss linear;
    //div(phi,U)      Gauss limitedLinearV 1;

    //div(phi,U)      bounded Gauss linearUpwindV default;
    div(phi,U)      bounded Gauss linearUpwindV grad(U);

    div((nuEff*dev2(T(grad(U))))) Gauss linear;

    div(phi,k)		bounded Gauss linearUpwind default;
    div(phi,omega)	bounded Gauss linearUpwind default;
}

laplacianSchemes
{
     default         Gauss linear limited 0.5; //corrected; //Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default        limited 0.5;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
